/* No comment provided by engineer. */
"AppleScript.authorization.error" = "You didn't allow Dynamic Dark Mode to manage dark mode";

/* Scare the user so they report bugs. */
"Bug.general.title" = "バグを報告する";

/* Request users to provide more context. */
"Bug.known.title" = "Encountered a Known Issue";

/* User did not authorize this app to use location. */
"Location.notAuthorized" = "You did NOT authorize Dynamic Dark Mode to get your location.";

/* Failed to attain user location for sunset/sunrise calculation. */
"Location.notAvailable" = "現在地を取得できませんでした";

/* Took too long to use up retries, most likely off Wi-Fi. */
"Location.timeout" = "タイムアウトしました。ネットワークの接続を確認してください";

/* Can't fetch user's current location. Using cache instead. */
"Location.useCache" = "Scheduled Using Previous Location";

/* Drop down menu item to show preferences */
"Menu.preferences" = "設定…";

/* Use system translation for quit */
"Menu.quit" = "終了";

/* Action item to toggle in from menu bar */
"Menu.toggle" = "ダークモードを切り替える";

/* User did not authorize this app to send notifications. */
"Notification.notAuthorized" = "You did NOT authorize Dynamic Dark Mode to send notifications.";

/* Indicates either enable or disable opens at login failed. */
"Preferences.opensAtLogin.failed" = "Failed to update \"opens at login\" settings";

/* Notification text for bug report */
"ScreenBrightnessObserver.startObserving.failed" = "Cannot observe screen brightness change.";

/* For touch bar button title */
"SettingsViewController.autoAdjustThreshold" = "Auto Adjust Threshold";

/* For touch bar button title */
"SettingsViewController.scheduleMode" = "Schedule Mode";

/* Astronomical */
"SunsetSunrise.astronomical" = "Astronomical";

/* Civil */
"SunsetSunrise.civil" = "Civil";

/* CustomRange */
"SunsetSunrise.customRange" = "カスタム";

/* Nautical */
"SunsetSunrise.nautical" = "Nautical";

/* Official */
"SunsetSunrise.official" = "公式";

/* Translate the same as System on preferences screen */
"SunsetSunrise.system" = "システム";

/* No comment provided by engineer. */
"SystemPreferences.open" = "設定を開く";

/* Translate the same as in all other setup process */
"SystemPreferences.skip" = "スキップ";

